; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v10 ?v13)
             (pred_8 ?v12 ?v4)
             (pred_6 ?v10 ?v4)
             (pred_2 ?v1 ?v10 )
	     (pred_9 ?v10)
             (pred_10 ?v2)
             (pred_3 ?v12)
             (pred_7 ?v4)
             (pred_5 ?v10)
             (pred_11 ?v12)
             (pred_12 ?v10)
             (pred_4 ))



(:action op_1
:parameters (?v6 ?v11 ?v7 ?v9)
:precondition (and (pred_10 ?v6) (pred_10 ?v11) (pred_3 ?v7) (pred_7 ?v9)
          (pred_1 ?v6 ?v11) (pred_8 ?v7 ?v9)
                   (pred_6 ?v11 ?v9) (pred_9 ?v6) 
                   (pred_5 ?v11) (pred_11 ?v7))
:effect (and  (pred_12 ?v11) (not (pred_5 ?v11))))


(:action op_3
:parameters (?v6 ?v8)
:precondition (and (pred_10 ?v6) (pred_10 ?v8)
               (pred_9 ?v6) (pred_1 ?v6 ?v8) (pred_12 ?v8))
:effect (and (pred_9 ?v8) (not (pred_9 ?v6))))

(:action op_5
:parameters (?v6 ?v7)
:precondition (and (pred_10 ?v6) (pred_3 ?v7) 
                  (pred_9 ?v6) (pred_2 ?v7 ?v6) (pred_4 ))
:effect (and (pred_11 ?v7)
   (not (pred_2 ?v7 ?v6)) (not (pred_4 ))))


(:action op_4
:parameters (?v6 ?v3 ?v5)
:precondition (and (pred_10 ?v6) (pred_3 ?v3) (pred_3 ?v5)
                  (pred_9 ?v6) (pred_11 ?v5) (pred_2 ?v3 ?v6))
:effect (and (pred_11 ?v3) (pred_2 ?v5 ?v6)
        (not (pred_11 ?v5)) (not (pred_2 ?v3 ?v6))))

(:action op_2
:parameters (?v6 ?v7)
:precondition (and (pred_10 ?v6) (pred_3 ?v7) 
                  (pred_9 ?v6) (pred_11 ?v7))
:effect (and (pred_4 ) (pred_2 ?v7 ?v6) (not (pred_11 ?v7)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_15 obj_21 obj_25 obj_04 obj_08 obj_22 obj_02 obj_09 obj_06 obj_27 obj_30 obj_26 obj_07 obj_31 obj_24 obj_12 obj_23 obj_03 obj_10 obj_01 obj_11 obj_05 obj_32 obj_18 obj_14
    obj_19 obj_20 obj_28
    obj_29 obj_17 obj_16 obj_13
    )

    (:init
       (pred_4)

       (pred_10 obj_15)
       (pred_10 obj_21)
       (pred_10 obj_25)
       (pred_10 obj_04)
       (pred_10 obj_08)
       (pred_10 obj_22)
       (pred_10 obj_02)
       (pred_10 obj_09)
       (pred_10 obj_06)
       (pred_10 obj_27)
       (pred_10 obj_30)
       (pred_10 obj_26)
       (pred_10 obj_07)
       (pred_10 obj_31)
       (pred_10 obj_24)
       (pred_10 obj_12)
       (pred_10 obj_23)
       (pred_10 obj_03)
       (pred_10 obj_10)
       (pred_10 obj_01)
       (pred_10 obj_11)
       (pred_10 obj_05)
       (pred_10 obj_32)
       (pred_10 obj_18)
       (pred_10 obj_14)
       (pred_7 obj_19)
       (pred_7 obj_20)
       (pred_7 obj_28)
       (pred_3 obj_29)
       (pred_3 obj_17)
       (pred_3 obj_16)
       (pred_3 obj_13)

       (pred_1 obj_15 obj_22)
       (pred_1 obj_15 obj_21)
       (pred_1 obj_21 obj_02)
       (pred_1 obj_21 obj_25)
       (pred_1 obj_21 obj_15)
       (pred_1 obj_25 obj_09)
       (pred_1 obj_25 obj_04)
       (pred_1 obj_25 obj_21)
       (pred_1 obj_04 obj_06)
       (pred_1 obj_04 obj_08)
       (pred_1 obj_04 obj_25)
       (pred_1 obj_08 obj_27)
       (pred_1 obj_08 obj_04)
       (pred_1 obj_22 obj_30)
       (pred_1 obj_22 obj_02)
       (pred_1 obj_22 obj_15)
       (pred_1 obj_02 obj_26)
       (pred_1 obj_02 obj_09)
       (pred_1 obj_02 obj_21)
       (pred_1 obj_02 obj_22)
       (pred_1 obj_09 obj_07)
       (pred_1 obj_09 obj_06)
       (pred_1 obj_09 obj_25)
       (pred_1 obj_09 obj_02)
       (pred_1 obj_06 obj_31)
       (pred_1 obj_06 obj_27)
       (pred_1 obj_06 obj_04)
       (pred_1 obj_06 obj_09)
       (pred_1 obj_27 obj_24)
       (pred_1 obj_27 obj_08)
       (pred_1 obj_27 obj_06)
       (pred_1 obj_30 obj_12)
       (pred_1 obj_30 obj_26)
       (pred_1 obj_30 obj_22)
       (pred_1 obj_26 obj_23)
       (pred_1 obj_26 obj_07)
       (pred_1 obj_26 obj_02)
       (pred_1 obj_26 obj_30)
       (pred_1 obj_07 obj_03)
       (pred_1 obj_07 obj_31)
       (pred_1 obj_07 obj_09)
       (pred_1 obj_07 obj_26)
       (pred_1 obj_31 obj_10)
       (pred_1 obj_31 obj_24)
       (pred_1 obj_31 obj_06)
       (pred_1 obj_31 obj_07)
       (pred_1 obj_24 obj_01)
       (pred_1 obj_24 obj_27)
       (pred_1 obj_24 obj_31)
       (pred_1 obj_12 obj_11)
       (pred_1 obj_12 obj_23)
       (pred_1 obj_12 obj_30)
       (pred_1 obj_23 obj_05)
       (pred_1 obj_23 obj_03)
       (pred_1 obj_23 obj_26)
       (pred_1 obj_23 obj_12)
       (pred_1 obj_03 obj_32)
       (pred_1 obj_03 obj_10)
       (pred_1 obj_03 obj_07)
       (pred_1 obj_03 obj_23)
       (pred_1 obj_10 obj_18)
       (pred_1 obj_10 obj_01)
       (pred_1 obj_10 obj_31)
       (pred_1 obj_10 obj_03)
       (pred_1 obj_01 obj_14)
       (pred_1 obj_01 obj_24)
       (pred_1 obj_01 obj_10)
       (pred_1 obj_11 obj_05)
       (pred_1 obj_11 obj_12)
       (pred_1 obj_05 obj_32)
       (pred_1 obj_05 obj_23)
       (pred_1 obj_05 obj_11)
       (pred_1 obj_32 obj_18)
       (pred_1 obj_32 obj_03)
       (pred_1 obj_32 obj_05)
       (pred_1 obj_18 obj_14)
       (pred_1 obj_18 obj_10)
       (pred_1 obj_18 obj_32)
       (pred_1 obj_14 obj_01)
       (pred_1 obj_14 obj_18)
       (pred_5 obj_24)
       (pred_5 obj_09)
       (pred_5 obj_31)
       (pred_5 obj_12)
       (pred_6  obj_24 obj_19)
       (pred_6  obj_09 obj_20)
       (pred_6  obj_31 obj_28)
       (pred_6  obj_12 obj_20)
       (pred_12 obj_15)
       (pred_12 obj_21)
       (pred_12 obj_25)
       (pred_12 obj_04)
       (pred_12 obj_08)
       (pred_12 obj_22)
       (pred_12 obj_02)
       (pred_12 obj_06)
       (pred_12 obj_27)
       (pred_12 obj_30)
       (pred_12 obj_26)
       (pred_12 obj_07)
       (pred_12 obj_23)
       (pred_12 obj_03)
       (pred_12 obj_10)
       (pred_12 obj_01)
       (pred_12 obj_11)
       (pred_12 obj_05)
       (pred_12 obj_32)
       (pred_12 obj_18)
       (pred_12 obj_14)

       (pred_8  obj_29 obj_19)
       (pred_8  obj_17 obj_20)
       (pred_8  obj_16 obj_28)
       (pred_8  obj_13 obj_19)
       (pred_2 obj_29 obj_30)
       (pred_2 obj_17 obj_22)
       (pred_2 obj_16 obj_27)
       (pred_2 obj_13 obj_05)
       (pred_9 obj_05)
    )

    (:goal (and
       (pred_2 obj_16 obj_30)
    ))
(:constraints
  (always (not (pred_9 obj_02)))
)
)

; plan
1. (op_3 obj_05 obj_23)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_23)
   goals met: 0 of 1
2. (op_3 obj_23 obj_26)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_26)
   goals met: 0 of 1
3. (op_3 obj_26 obj_30)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_30)
   goals met: 0 of 1
4. (op_3 obj_30 obj_22)
   deleted: (pred_9 obj_30)
   added: (pred_9 obj_22)
   goals met: 0 of 1
5. (op_5 obj_22 obj_17)
   deleted: (pred_2 obj_17 obj_22) (pred_4)
   added: (pred_11 obj_17)
   goals met: 0 of 1
6. (op_3 obj_22 obj_30)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_30)
   goals met: 0 of 1
7. (op_2 obj_30 obj_17)
   deleted: (pred_11 obj_17)
   added: (pred_4) (pred_2 obj_17 obj_30)
   goals met: 0 of 1
8. (op_3 obj_30 obj_22)
   deleted: (pred_9 obj_30)
   added: (pred_9 obj_22)
   goals met: 0 of 1
9. (op_3 obj_22 obj_15)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_15)
   goals met: 0 of 1
10. (op_3 obj_15 obj_21)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_21)
   goals met: 0 of 1
11. (op_3 obj_21 obj_25)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_25)
   goals met: 0 of 1
12. (op_3 obj_25 obj_04)
   deleted: (pred_9 obj_25)
   added: (pred_9 obj_04)
   goals met: 0 of 1
13. (op_3 obj_04 obj_08)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_08)
   goals met: 0 of 1
14. (op_3 obj_08 obj_27)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_27)
   goals met: 0 of 1
15. (op_5 obj_27 obj_16)
   deleted: (pred_2 obj_16 obj_27) (pred_4)
   added: (pred_11 obj_16)
   goals met: 0 of 1
16. (op_3 obj_27 obj_06)
   deleted: (pred_9 obj_27)
   added: (pred_9 obj_06)
   goals met: 0 of 1
17. (op_1 obj_06 obj_31 obj_16 obj_28)
   deleted: (pred_5 obj_31)
   added: (pred_12 obj_31)
   goals met: 0 of 1
18. (op_3 obj_06 obj_31)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_31)
   goals met: 0 of 1
19. (op_3 obj_31 obj_07)
   deleted: (pred_9 obj_31)
   added: (pred_9 obj_07)
   goals met: 0 of 1
20. (op_3 obj_07 obj_26)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_26)
   goals met: 0 of 1
21. (op_3 obj_26 obj_30)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_30)
   goals met: 0 of 1
22. (op_4 obj_30 obj_29 obj_16)
   deleted: (pred_11 obj_16) (pred_2 obj_29 obj_30)
   added: (pred_11 obj_29) (pred_2 obj_16 obj_30)
   goals met: 1 of 1
